DemonTu/ALL_SmartBatterySwitch_CC2640/tirtos_simplelink_2_13_00_06/packages/ti/drivers/uart/UARTCC3200.c
        DebugP_log2("UART:(%p) read '0x%02x'",
            ((UARTCC3200_HWAttrs const *)(handle->hwAttrs))->baseAddr,
            (unsigned char)readIn);

        *buffer = readIn;
        buffer++;
        /* In blocking mode, readCount doesn't not need a lock */
        object->readCount--;

        if (object->state.readDataMode == UART_DATA_TEXT &&
                object->state.readReturnMode == UART_RETURN_NEWLINE &&
                readIn == '\n') {
            break;
        }
    }

    ClockP_stop(object->timeoutClk);
    return (object->readSize - object->readCount);
}

/*
 *  ======== readTaskCallback ========
 *  This function is called the first time by the UART_read task and tries to
 *  get all the data it can get from the ringBuffer. If it finished, it will
 *  perform the user supplied callback. If it didn't finish, the ISR must handle
 *  the remaining data. By setting the drainByISR flag, the UART_read function
 *  handed over the responsibility to get the remaining data to the ISR.
 */
static int readTaskCallback(UART_Handle handle)
{
    unsigned int               key;
    UARTCC3200_Object         *object = handle->object;
    unsigned char              readIn;
    unsigned char             *bufferEnd;
    bool                       makeCallback = false;

    object->state.drainByISR = false;
    bufferEnd = (unsigned char*)object->readBuf + object->readSize;

    while (object->readCount) {
        if (RingBuf_get(&object->ringBuffer, &readIn) < 0) {
            break;
        }

        DebugP_log2("UART:(%p) read '0x%02x'",
            ((UARTCC3200_HWAttrs const *)(handle->hwAttrs))->baseAddr,
            (unsigned char)readIn);

        *(unsigned char *)(bufferEnd -
            object->readCount * sizeof(unsigned char)) = readIn;

        key = HwiP_disable();

        object->readCount--;

        HwiP_restore(key);

        if ((object->state.readDataMode == UART_DATA_TEXT) &&
            (object->state.readReturnMode == UART_RETURN_NEWLINE) &&
            (readIn == '\n')) {
            makeCallback = true;
            break;
        }
    }

    if (!object->readCount || makeCallback) {
        /* Nested UART_reads from within callbacks are NOT supported!!! */
        object->readCallback(handle, object->readBuf,
            object->readSize - object->readCount);
        object->readSize = 0;
    }
    else {
        object->state.drainByISR = true;
    }

    return (0);
}

/*
 *  ======== releasePowerConstraint ========
 *  When a UART_write has finished or was canceled, startTxFifoEmptyClk starts a
 *  clock object to allow the TX FIFO to drain. Once the FIFO has drained we can
 *  release the deep sleep power constraint. If data is still being passed
 *  through the UART, then we'll check again in 1 system tick.
 */
static void releasePowerConstraint(UART_Handle handle)
{
    UARTCC3200_Object *object = handle->object;

    if (UARTBusy(((UARTCC3200_HWAttrs const *)handle->hwAttrs)->baseAddr)) {
        DebugP_log1("UART:(%p) UART is still busy; will check again in 1 tick",
            ((UARTCC3200_HWAttrs const *)(handle->hwAttrs))->baseAddr);
        /*
         * Somehow the UART is still busy, so restart the clock and checck again
         * in 1 system tick.
         */
        ClockP_start(object->txFifoEmptyClk, 1);
        return;
    }

    Power_releaseConstraint(PowerCC3200_DISALLOW_DEEPSLEEP);
    object->state.txEnabled = false;

    DebugP_log1("UART:(%p) UART released write power constraint",
        ((UARTCC3200_HWAttrs const *)(handle->hwAttrs))->baseAddr);
}

/*
 *  ======== startTxFifoEmptyClk ========
 *  Last write to TX FIFO is done, but not shifted out yet. Start a clock
 *  which will trigger when the TX FIFO should be empty.
 *
 *  @param(handle)         The UART_Handle for ongoing write.
 */
static void startTxFifoEmptyClk(UART_Handle handle, bool inIsr)
{
    UARTCC3200_Object *object = handle->object;

    if (inIsr) {
        ClockP_startFromISR(object->txFifoEmptyClk,
            object->writeEmptyClkTimeout);
    }
    else {
        ClockP_start(object->txFifoEmptyClk,
            object->writeEmptyClkTimeout);
    }
}

/*
 *  ======== writeData ========
 */
static void writeData(UART_Handle handle, bool inISR)
{
    UARTCC3200_Object         *object = handle->object;
    UARTCC3200_HWAttrs const  *hwAttrs = handle->hwAttrs;
    unsigned char             *writeOffset;

    writeOffset = (unsigned char *)object->writeBuf +
        object->writeSize * sizeof(unsigned char);
    while (object->writeCount) {
        if (!MAP_UARTCharPutNonBlocking(hwAttrs->baseAddr,
                *(writeOffset - object->writeCount))) {
            /* TX FIFO is FULL */
            break;
        }
        if ((object->state.writeDataMode == UART_DATA_TEXT) &&
            (*(writeOffset - object->writeCount) == '\n')) {
            MAP_UARTCharPut(hwAttrs->baseAddr, '\r');
        }
        object->writeCount--;
    }

    if (!object->writeCount) {
        MAP_UARTIntDisable(hwAttrs->baseAddr, UART_INT_TX);

        startTxFifoEmptyClk(handle, inISR);

        object->writeCallback(handle, (void *)object->writeBuf,
            object->writeSize);

        DebugP_log2("UART:(%p) Write finished, %d bytes written",
            hwAttrs->baseAddr, object->writeSize - object->writeCount);
    }
}

/*
 *  ======== writeSemCallback ========
 *  Simple callback to post a semaphore for the blocking mode.
 */
static void writeSemCallback(UART_Handle handle, void *buffer, size_t count)
{
    UARTCC3200_Object *object = handle->object;

    SemaphoreP_postFromISR(object->writeSem);
}
